[
  {
    "quote": "RupeeFlow made international bill payments effortless. I can now send money to India in seconds using UPI, no long waits, no hidden charges.",
    "name": "Ananya Mehta",
    "role": "Product Designer, Singapore"
  },
  {
    "quote": "Their advanced UPI switch is a game-changer. Cross-border transfers that used to take hours now happen instantly, it feels like sending a local UPI payment.",
    "name": "Rajesh Kumar",
    "role": "Tech Consultant, Dubai"
  },
  {
    "quote": "The AI insights in RupeeFlow are brilliant. I get spending predictions, smart alerts, and automatic payment optimization, it's like having a personal finance assistant.",
    "name": "Emily Carter",
    "role": "Marketing Manager, London"
  },
  {
    "quote": "As a small business owner, RupeeFlow helped us simplify supplier payments overseas. Low fees and transparent forex rates make a huge difference to our margins.",
    "name": "Vikram Shah",
    "role": "Founder, TechSpire Solutions"
  },
  {
    "quote": "Finally, a fintech that understands NRIs. Paying my family's bills in India through RupeeFlow is fast, reliable, and costs a fraction of traditional methods.",
    "name": "Priya Nair",
    "role": "Software Engineer, Toronto"
  },
  {
    "quote": "The integration process was seamless. RupeeFlow’s developer-friendly APIs and sandbox made it easy to embed UPI transfers into our global payments app.",
    "name": "David Nguyen",
    "role": "Lead Developer, FinLink"
  },
  {
    "quote": "The AI-powered UPI switch feels futuristic. Payments are faster, smarter, and safer, it’s reshaping how we handle cross-border transactions.",
    "name": "Sarah Thompson",
    "role": "Operations Head, GlobalPay UK"
  },
  {
    "quote": "We switched to RupeeFlow for its real-time settlement and low transaction fees. Our customers noticed the speed, and we noticed the savings.",
    "name": "Arjun Patel",
    "role": "Finance Lead, NeoBiz India"
  },
  {
    "quote": "Cross-border payments with RupeeFlow are as easy as sending a message. The experience is smooth, transparent, and incredibly fast, love it!",
    "name": "Lara Mitchell",
    "role": "Freelance Consultant, Sydney"
  }
]
